SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( 501_LMR_EMU_G_DMBSO
	Type ( Engine )
	WagonShape ( 501_LMR_EMU_G_DMBSO.s )
	Size ( 2.74m 3.768m 19.9m )
	comment( 250000lbs US )
	Mass ( 40t )
	WheelRadius ( 24in )
	InertiaTensor ( Box (2.7m 3.768m 19.6m) )
	Coupling (
		Type ( Automatic )
		Spring (
			Stiffness ( 1e6N/m 5e6N/m )
			Damping ( 6e9N/m/s 6e9N/m/s )
			Break ( 7e9N 7e9N )
			r0 ( 20cm 30cm  )
		)
		comment( CouplingHasRigidConnection () )
		Velocity ( 0.1m/s )
		
	)
	Buffers (
		Spring (
			Stiffness ( 1e7N/m 0 )
			Damping ( 1e6N/m/s 0 )
			r0 ( 0m 1e9 )
		)
		Centre ( 0.5 )
		Radius ( 1 )
		Angle ( 0.5deg )
	)
	
	Adheasion ( 0.2 0.4 2 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 2.5*250e3lbs )
	DerailBufferForce ( 200kN )
	NumWheels (	8 )
	Friction (
		100N/m/s		1		-1mph		0		1
		5.1N/rad/s		1		-1rad/s		0		1
	)
	AntiSlip ()

	BrakeEquipmentType( "Triple_valve, Auxilary_reservoir, Emergency_brake_reservoir" )

	BrakeSystemType( "Air_single_pipe" )
	MaxBrakeForce ( 27000N )
	
	EmergencyBrakeResMaxPressure( 110 )
	TripleValveRatio( 2.5 )
	MaxReleaseRate( 30 )
	MaxApplicationRate( 25 )
	MaxAuxilaryChargingRate( 20 )
	EmergencyResCapacity( 10 )
	EmergencyResChargingRate( 25 )
	BrakeCylinderPressureForMaxBrakeBrakeForce( 70 )

	IntakePoint ( -3.33 0.4 FuelDiesel )
	IntakePoint ( 3.33 0.4 FuelDiesel )
	Inside (
        PassengerCabinFile ( 501_LMR_EMU_G_DMBSO.s )
    	  PassengerCabinHeadPos ( 0.8882689 2.481328 -8.953415 )
        RotationLimit ( 0 80 0 )
        StartDirection ( 0 0 0 )
        Sound ( "..\\..\\Common.Sound\\EMU_Class421\\2000Pas.sms" )
     )
        
     Lights	 (  10
           	Light	(
			comment( Sphere of light )
			Type	( 1 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
                        TimeofDay ( 2 )                         
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0.0 3.5 0 )
					Transition ( 0 )
					Radius ( 80.0 )
					Angle ( 20.0 )
					)
				)
			)			

		Light	(
			comment( Sphere of light )
			Type	( 1 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
                        TimeOfDay ( 2 )                        
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffaa )
					Position ( 0.0 3.5 0 )
					Transition ( 0 )
					Radius ( 50.0 )
					Angle ( 10.0 )
					)
				)
			)
			
		Light	(
			comment( Head light right dim )
				Type		( 0 )
				Conditions	(
					Headlight ( 2 )
					Unit ( 2 )
					)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle	( 0 )
				States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( 99999999 )
					Position ( -0.1 2.7 9.8)
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

		Light	(
			comment( Head light left dim )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( 99999999 )
					Position ( 0.1 2.7 9.8)
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)
		Light	(
			comment( Head light right bright )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffffff )
					Position ( 0.1 2.7 9.8)
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)

            Light	(
			comment( Headlight light left bright )
				Type		( 0 )
				Conditions	(
					Headlight ( 3 )
					Unit ( 2 )
					)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle	( 0 )
				States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffffff )
					Position ( -0.1 2.7 9.8)
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)	
			
		
	
		Light	(
			comment( Red light  )
			Type		( 0 )
			Conditions	(
						Headlight ( 2 )
						Unit ( 3 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( -0.26 1.60 9.8)
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.35 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)
 
		Light	(
			comment( Red light  )
			Type		( 0 )
			Conditions	(
						Headlight ( 3 )
						Unit ( 3 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( -0.26 1.60 9.8)
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.35 )
					Elevation ( 0.0 0.0 0.0 )
					
					)
				)
			)

           Light ( 
                  comment( Spark shoes ) 
			Type ( 0 ) 
			Conditions ( 
			Headlight ( 0 ) 
			Unit ( 0 ) 
			) 
			Cycle ( 0 ) 
			FadeIn ( 0 ) 
			FadeOut ( 0.5 ) 
			States ( 28 
			State ( 
			Duration ( 1 ) 
			LightColour ( 00000000 ) 
			Position ( 1.1 0.4 7.6 ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( ff66ccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 1.1 0.4 7.6 ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( ffccccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1.0 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( ff66ccff ) 
			Position ( 1.1 0.4 7.6 ) 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( ffccccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 1.0 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( ff66ccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( ffccccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 1.0 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( ff66ccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( ffccccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 1.0 ) 
			) 
			State ( 
			Duration ( 0.5 ) 
			LightColour ( 00000000 ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( ff66ccff ) 
			Position ( 1.1 0.4 7.6 ) 
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( ff66ccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 3 ) 
			LightColour ( 00000000 ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( ff66ccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 0.7 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( ff66ccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.7 ) 
			) 
			State ( 
			Duration ( 5 ) 
			LightColour ( 00000000 ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( ff66ccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 1.5 ) 
			) 
			State ( 
			Duration ( 0.25 ) 
			LightColour ( 00000000 ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( ff66ccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 0.8 ) 
			) 
			State ( 
			Duration ( 0.5 ) 
			LightColour ( ff66ccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 1.0 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( ff66ccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1.5 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 00000000 ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.5 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( ff66ccff ) 
			Position ( 1.1 0.4 7.6  ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 0.8 ) 
			) 
			State ( 
			Duration ( 0.6 ) 
			LightColour ( ffccffff ) 
			Position ( 1.1 0.4 7.6 ) 
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 1.0 ) 
                  )
               )
          )
      )  

    	Sound ( "..\\..\\Common.Sound\\EMU_Class421\\2000Eng.sms" )
	)

Engine ( 501_LMR_EMU_G_DMBSO
	Effects
		(
		DieselSpecialEffects
			(
				comment
				(
					the format of these little blocks is as follow:

					offset.x offset.y offset.z
					normal.x normal.y normal.z
					width in metres

					defining the offset from the shape pivot point
					where steam / smoke should appear, the direction
					it should go and the width of the nozzle
				)

				Exhaust1
				(
					0.5 3.78002 1.22
					0 1 0 
					0.1
				)
				Exhaust2
				(
					0.5 3.78 1.22
					0 1 0 
					0.1
				)
			)
        	)
        
	Wagon ( 501_LMR_EMU_G_DMBSO )
	Type ( Diesel )
	MaxPower ( 1000hp )
	comment( est estimated by comparision with dash9 )
	MaxForce ( 280kN )	
	MaxContinuousForce ( 296kN )
	MaxVelocity ( 75mph )
	MaxCurrent ( 1800A ) 
	WheelRadius ( 24in )
	comment( sanding system is switched off when faster than given velocity )
	Sanding ( 1e9mph )

	NumWheels ( 1 )
	MaxTemperature ( 120 )
	MaxOilPressure ( 90 )

 	CabView ( "..\\..\\common.cab\\Class_76\\Class76.cvf" )
	HeadOut (  -1.55 2.9 8.7 )
	MaxDieselLevel ( 380gal )
	DieselUsedPerHourAtMaxPower ( 60gal )
	DieselUsedPerHourAtIdle ( 10gal )

	AirBrakesAirCompressorPowerRating( 1.2 )
	AirBrakesMainMinResAirPressure( 0 )
	AirBrakesMainMaxAirPressure( 90 )
	AirBrakesMainResVolume( 8 )
	AirBrakesAirCompressorWattage( 19000 )
	AirBrakesCompressorRestartPressure( 87 )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure( 0.22 )
	AirBrakesIsCompressorElectricOrMechanical( 1 )

	EngineBrakesControllerMinPressureReduction( 6 )
	TrainBrakesControllerMinPressureReduction( 6 )
	EngineBrakesControllerHasProportionalBrake( 1 )
	EngineBrakesProportionalBrakeLag( 0.9 )
	EngineBrakesControllerMaxApplicationRate( 20 )
	TrainBrakesControllerMaxApplicationRate( 20 )
	EngineBrakesControllerMaxReleaseRate( 15 )
	TrainBrakesControllerMaxReleaseRate( 4 )
	EngineBrakesControllerEmergencyApplicationRate( 50 )
	TrainBrakesControllerEmergencyApplicationRate( 50 )
	EngineBrakesControllerMinSystemPressure( 0 )
	TrainBrakesControllerMinSystemPressure( 0 )
	EngineBrakesControllerMaxSystemPressure( 90 )
	TrainBrakesControllerMaxSystemPressure( 90 )
	EngineBrakesControllerEmergencyBrakeTimePenalty( 60 )
	TrainBrakesControllerEmergencyBrakeTimePenalty( 60 )
	EngineBrakesControllerFullServicePressureDrop( 26 )
	TrainBrakesControllerFullServicePressureDrop( 26 )


	DynamicBrakesMinUsableSpeed( 5 )
	DynamicBrakesMaximumEffectiveSpeed( 25 )
	DynamicBrakesMaximumForce( 20000 )
	DynamicBrakesResistorCurrentLimit ( 5000 )
	DynamicBrakesCutInSpeed( 8 )
	DynamicBrakesMaxAirBrakePressure ( 15 )
	DynamicBrakesFadingSpeed( 25 )
	DynamicBrakesDelayTimeBeforeEngaging ( 10 )
	DynamicBrakesMaximumSpeedForFadeOut ( 65 )
	DynamicBrakesEffectAtMaximumFadeOut( 0 )
	DynamicBrakesHigherSpeedCurveExponent( 1 )
	DynamicBrakesLowerSpeedCurveExponent( 1 )
	DynamicBrakesNumberOfControllerNotches( 10 )


	BrakesEngineBrakeType( "Air_single_pipe"  )
	BrakesTrainBrakeType( "Air_single_pipe" )
        BrakesEngineControllers( "Independent, Train, Dynamic" )
        
        EngineBrakesControllerDirectControlExponent( 1 )

	MaxDieselLevel ( 380gal )
	DieselUsedPerHourAtMaxPower ( 60gal )
	DieselUsedPerHourAtIdle ( 10gal )

	DieselSmokeEffectInitialMagnitude( 0 )
	DieselSmokeEffectMaxMagnitude( 0 )
	DieselSmokeEffectInitialSmokeRate( 0 )
	DieselSmokeEffectMaxSmokeRate( 0 )	
	
	DieselEngineIdleRPM( 255 )
	DieselEngineMaxRPM( 904 )
	DieselEngineSpeedOfMaxTractiveEffort( 13mph )        
        DieselEngineMaxRPMChangeRate( 40 )

	DoesHornTriggerBell( 0 )

	EmergencyStopMonitor(
    		MonitoringDeviceMonitorTimeLimit( 0 )
    		MonitoringDeviceAlarmTimeLimit( 0 )
    		MonitoringDevicePenaltyTimeLimit( 0 )
    		MonitoringDeviceCriticalLevel( 0 )
    		MonitoringDeviceResetLevel( 0 )
    		MonitoringDeviceAppliesFullBrake( 0 )
    		MonitoringDeviceAppliesEmergencyBrake( 1 )
    		MonitoringDeviceAppliesCutsPower( 0 )
    		MonitoringDeviceAppliesShutsDownEngine( 0 )
    		)

	AWSMonitor(
		MonitoringDeviceMonitorTimeLimit( -1 )
		MonitoringDeviceAlarmTimeLimit( 5 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 0 )
		MonitoringDeviceAppliesEmergencyBrake( 1 )
		MonitoringDeviceAppliesCutsPower( 0 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		)
	
	EngineVariables( 3600 )
			
        EngineControllers (
            Throttle ( 0 1 0.125 0 0.
                NumNotches ( 9
                    Notch ( 0       0 Dummy )
                    Notch ( 0.125   0 Dummy )
                    Notch ( 0.25    0 Dummy )
                    Notch ( 0.375   0 Dummy )
                    Notch ( 0.5     0 Dummy )
                    Notch ( 0.625   0 Dummy )
                    Notch ( 0.75    0 Dummy )
                    Notch ( 0.875   0 Dummy )
                    Notch ( 1       0 Dummy )
                )
            )
            Brake_Engine ( 0 1 0.0125 0 
                NumNotches ( 1
                    Notch( 0  1 Dummy )
                )
            )
            Brake_Train ( 0 1 0.0125 0.75 
                NumNotches ( 5
                    Notch( 0    0 TrainBrakesControllerReleaseStart )
                    Notch( 0.3  1 TrainBrakesControllerGraduatedSelfLapLimitedHoldingStart )
                    Notch( 0.85 0 TrainBrakesControllerSuppressionStart )
                    Notch( 0.9  0 TrainBrakesControllerContinuousServiceStart )
                    Notch( 0.95 0 TrainBrakesControllerEmergencyStart )
                )
            )
            Brake_Dynamic ( 0 1 0.11 0 
                NumNotches ( 10 
                	Notch ( 0       0 Dummy )
                    	Notch ( 0.11    0 Dummy )
                  	Notch ( 0.22    0 Dummy )
                   	Notch ( 0.33    0 Dummy )
                   	Notch ( 0.44    0 Dummy )
                   	Notch ( 0.55    0 Dummy )
                   	Notch ( 0.66    0 Dummy )
                   	Notch ( 0.77    0 Dummy )
                   	Notch ( 0.88    0 Dummy )
                   	Notch ( 1       0 Dummy )
                )
            )
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            AWS ( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Wipers ( 0 1 0 )
            EmergencyStopResetToggle( 0 1 0 )
            EmergencyStopToggle( 0 1 0 )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
            BailOffButton( 0 1 0 )
        )
        
    	Sound ( "..\\..\\Common.Sound\\EMU_Class421\\2000Cab.sms" )
    	Name ("BR EMU Class 501 Green")
    	Description (
	"BR, class 501 1957 stock\n"+
	"Built by: BR/BREL York Introduced 1957.\n"+
	"Locomotive type: Electric Multiple Unit\n"+
	"Power source: DC 630 Volts 3rd and 4th Rail\n"+
	"Power at rail: 740hp\n"+
	"Max. speed: 70 mph \n"+	
	"Route Availability:London District Lines out of Euston\n"+
	"Traction motors: GEC 4x 185hp Traction Motors\n"+		
	"Height: 9ft.6in\n"+
	"Weight: This coach 47 tons. Complete unit 106 tons \n"+
	"Length: This coach 57ft 5in. Complete unit 171ft.11in\n"+
	"Width: 9 ft. "
    	)
    	EngineOperatingProcedures (
    	"To move forward\n"+
	"1.	Press the W key to move the Reverser to Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
	"4.	Press the D key to move the throttle from Idle to Notch 1.\n"+
	"5.	Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the throttle to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+
	"To apply the dynamic brakes\n"+
	"1.	Press the A key to move the throttle to the Idle position.\n"+
	"2.	Wait for 10 seconds, then press the . (PERIOD) key to advance the Dynamic Brake handle from Off to the Setup position. After allowing a few seconds for braking circuit setup, press the . (PERIOD) key again to set the desired level of dynamic braking (Levels 1 - 8).\n\n"+
	"To release the dynamic brakes\n"+
	"1. Press the D key to move the throttle towards Idle.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
	"To bail off the train brakes on the locomotive\n"+
	"1. Press the / (FORWARD SLASH) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
	"To apply the locomotive brake\n"+
	"1.	Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
	"To release the locomotive brake\n"+
	"1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
	"To activate emergency braking\n"+
	"1.	Press the A key to reduce the throttle to Idle.\n"+
	"2.	Press the BACKSPACE key to activate emergency braking.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+
	"2.	Press the S key to move the Reverser to the Reverse position.\n"+
	"3.	Release the brakes.\n"+
	"4.	Slowly advance the throttle lever (D key).\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window."
    	) 
)

